{
  "architectures": [
    "AquilaForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_aquila.AquilaConfig",
    "AutoModelForCausalLM": "modeling_aquila.AquilaForCausalLM"
  },
  "bos_token_id": 100006,
  "eos_token_id": 100007,
  "hidden_act": "silu",
  "hidden_size": 6144,
  "initializer_range": 0.02,
  "intermediate_size": 24576,
  "max_position_embeddings": 4096,
  "model_type": "llama",
  "num_attention_heads": 48,
  "num_hidden_layers": 60,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.31.0",
  "use_cache": false,
  "vocab_size": 100008
}
